Revit 2026 API

# ControlledApplicationSharedParametersFilename Property

---
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string SharedParametersFilename { get; set; }
```
```vb
Public Property SharedParametersFilename As String
	Get
	Set
```
```cpp
public:
property String^ SharedParametersFilename {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member SharedParametersFilename : string with get, set
```

#### Property Value

String

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace